import pandas as pd
data = {
    "name": ["Ali", "Reza", "Sara","mohammad","sepehr"],
    "age": [20, 22, 19,14,18],
    "score":[20,18,17,None,14],
    "city":["Tehran","Karaj","Karaj","Tehran","shiraz"]
}

df = pd.DataFrame(data)


# print(df)                                 #نمایش کلاس 

# print(type(data))                         #نمایش دادن تایپ ورودی 

# print(df.head())                          #نمایش چند سطر اول

# print(df.tail())                          #نمایش چند سطر آخر

# print(df.shape)                           #تعداد سطر و ستون

# print(df.columns)                         #نمایش فقط اسم ستون‌ها+تایپ انها

# df.info()                                 #اطلاعات کامل

# print(df[["city","score","name","age"]])         #نمایش سطر دلخواه با استفاده از اسم سطر 

# print(df.iloc[0,1])                       #(فقط فقط هم چایگاه رو باید بدیم این مثال که جایگاه 1 رو دادیم ا )انتخاب سطر دلخواه و اگر هم بازه بخواهیم تاعین کنیم باید از :استفاده کنیم

# print(df.loc[0])                          #مثل ای لوک هست ولی بجای جایگاه اسم رو میگیری این صفر که ما دادیم رو در واقع اسم در نظر میگیری برای مثال در جدول دیگری ممکن است اسم ستون ها a b c d باشه در این صورت در لوک باد یزنیم a ولی در ای لوک باید یزنیم 

# print(df[df["age"] > 20])                 #فیلتر کردن افراد بالای 20 سال ستون age

# print(
#     df[(df["age"] > 18) & (df["age"] < 22)]
# )                                         #گزاشتن دوشرط برای مثال روبرو افراد بالای 18 و پایین تر 22 

# df["IDCODE"] = [233, 184,651,154]         # اضافه کرد ستون ایدی کد نکته: بابد تعداد وردی با تعداد اسم هایی که داریم یکی باشه .

# print(df)

# df = df.drop("IDCODE", axis=1)            # وقتی ااکسیز رو 1 باشه یعنی ستونی رو که بهش اسمش رو بدیم رو پاک میکنه اگه بخایم یک سطر رو پاک کنیم باید جای 1 صفر بزاریم و ردیفش رو بگیم مثلا 0 را جای ایدی کد میزاریمو سطر علی پاک میشه

# print(df)

# df.to_csv("students.csv")                 #به اکسل سیو میکنه و هر جا که باید بره ستون بعد کاما میزاره و ما باید از اکسل فعال کنیم تا مرتب بشه

# df=df.sort_values()                     # مرتب کردن ستون سن از کم به زیاد  

# df = df.sort_values("age",ascending=False)     # مرتب کردن ستون سن از زیاد به کم  

# print (df["age"].mean())                         # پرینت میانگین ستون سن

# print(df["age"].max())                            #پرینت بیشترین مقدار داخل ستون سن

# print(df["age"].min())                            #پرینت کمترین مقدار داخل ستون سن

# print(df["age"].sum())                            #پرینت جمع مقادیر داخل ستون سن 


# print(df["city"].value_counts())                    #پرینت تعداد مقادیر  شهر ها مثال : کرج :2 تهران : 2 شیراز : 1

# print(df["city"].unique())                            # مقادیر یکتا ستون سیتی نتیجه : تهران کرج شیراز درحالی که دو تا کرج دوتا تهران و یدونه شیراز هست (تکراری هارو فقط یکیش رو مینویسه)

# print(df.groupby("city")["age"].mean())                 #میانگین سن هر شهر را می‌دهد.

# print (df.isnull())                                   #(برای اینکه مقداری خالی باشه باید داخر را Nane بزاریم)پیدا کردن داده‌های خالی

# df["score"] = df["score"].fillna(0)                        # از ستون امتیاز هر جا خالی بود با صفر پر کن

# df.dropna()                                             # حذف سطر دارای مقدار خالی برای مثال اگر علی سن را وارد نگرده بود کلا سطر علی پاک میشود 


# concat & merge

# print(df.iloc[1])
# print(df.loc[1])
